Revit 2027 API
BuiltInFailures.SketchFailures.TooManyElementsInSketch Property
 This sketch is large. Performance will improve if constructed as several independent sketches.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TooManyElementsInSketch { get; }
Public Shared ReadOnly Property TooManyElementsInSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TooManyElementsInSketch {
	FailureDefinitionId^ get ();
}
static member TooManyElementsInSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace